>>> 과일 = ["사과","귤","수박"]
>>> for 변수 in 과일:
    print(변수)
    
사과
귤
수박
>>> 과일 = ["사과","귤","수박"]
>>> for 변수 in 과일:
    print("#####")
    
#####
#####
#####
>>> 변수="A""B""C"
>>> print(변수)
ABC

>>> for 변수 in [10,20,30]:
    print(변수)
    
10
20
30
>>> 리스트=[10,20,30]
>>> for 변수 in 리스트:
    print(변수)
    
10
20
30
>>> for 변수 in [10,20,30]:
    print(변수)
    
10
20
30
>>> for 변수 in [10,20,30]:
    print(변수)
    print("-------")
    
10
-------
20
-------
30
-------
>>> for 변수 in ["++++",10,20,30]:
    print(변수)
    
++++
10
20
30
>>> for 변수 in ["-------","-------","-------","-------"]:
    print(변수)
    
-------
-------
-------
-------
>>> for 리스트 in [100,200,300]:
    print(리스트+10)
    
110
210
310
>>> 리스트 =["김밥","라면","튀김"]
>>> for 메뉴 in 리스트:
    print("오늘의 메뉴:"+메뉴)
    
오늘의 메뉴:김밥
오늘의 메뉴:라면
오늘의 메뉴:튀김

>>> 리스트=["sk하이닉스","삼성전자","LG전자"]
>>> for 종목명 in 리스트:
    길이 = len(종목명)
    print(길이)
    
6
4
4

>>> 리스트 = ['dog', 'cat', 'parrot']
>>> for animal in 리스트:
    print(animal,len(animal))
    
dog 3
cat 3
parrot 6

>>> 리스트 = ['dog', 'cat', 'parrot']
>>> for animal in 리스트:
    print(animal[0])
    
d
c
p

>>> 리스트 = [1, 2, 3]
>>> for 변수 in 리스트:
    print(3*변수)
    
3
6
9
>>> 리스트 = [1,2,3]
>>> for 변수 in 리스트:
    print("3*",변수,"=",(3*변수))
    
3* 1 = 3
3* 2 = 6
3* 3 = 9